In [ ]:
## pandas 2

In [1]:
import pandas as pd
import numpy as np

In [7]:
ls=[1,2,3,4]
arr=np.array(ls)
ser=pd.Series(arr,index=['a','b','c','d'])
ser

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
ser.dtype

dtype('int64')

In [9]:
ser.size

4

In [10]:
ser.nbytes

32

In [11]:
ser.sum()

np.int64(10)

In [14]:
ser.mean()

np.float64(2.5)

In [18]:
ser=pd.Series(np.arange(1,100,1))
filter1=ser>36
filter2=ser<71
filter3=filter1 & filter2
ser[filter3]

36    37
37    38
38    39
39    40
40    41
41    42
42    43
43    44
44    45
45    46
46    47
47    48
48    49
49    50
50    51
51    52
52    53
53    54
54    55
55    56
56    57
57    58
58    59
59    60
60    61
61    62
62    63
63    64
64    65
65    66
66    67
67    68
68    69
69    70
dtype: int64

In [19]:
ser =pd.Series([1,2,3,4])
ser+100

0    101
1    102
2    103
3    104
dtype: int64

In [21]:
ser2=pd.Series([5,6,7,8,9])
ser+ser2

0     6.0
1     8.0
2    10.0
3    12.0
4     NaN
dtype: float64

In [25]:
ser3 =pd.Series([1,2,3,4],index=['a','b','c','e'])
ser4 =pd.Series([5,6,7,8],index=['a','f','g','h'])
ser3+ser4

a    6.0
b    NaN
c    NaN
e    NaN
f    NaN
g    NaN
h    NaN
dtype: float64

In [26]:
d={
    'id':[1,2,3,4],
    'Name':['Alex','Bob','Josh','Sara'],
    'Age':[25,24,31,28]
}
df=pd.DataFrame(d)
df

   id  Name  Age
0   1  Alex   25
1   2   Bob   24
2   3  Josh   31
3   4  Sara   28

In [30]:
l=[
    (1,'Alex',25),
    (2,'Bob',24),
    (3,'Josh',31),
    (4,'Sara',28)
]
df2=pd.DataFrame(l,columns=['Id','Name','Age'])
df2

   Id  Name  Age
0   1  Alex   25
1   2   Bob   24
2   3  Josh   31
3   4  Sara   28